Repository: marczak01/berkola
Catalog: berkola/locale/*/LC_MESSAGES/django.po
Languages: pl

source: About us
pl: O nas

source: Teaching methods
pl: Metody nauczania

source: Our team
pl: Nasz zespół

source: Pricing
pl: Oferta

source: Contact
pl: Kontakt

source: We are an online language school specializing in Polish as a foreign language.
pl: Jesteśmy internetową szkołą językową specjalizującą się w nauce języka polskiego jako obcego.

source: Master the Polish language with professional teachers. Join our interactive online lessons and discover Polish culture while improving your communication skills.
pl: Opanuj język polski z profesjonalnymi nauczycielami. Dołącz do naszych interaktywnych lekcji online i odkryj polską kulturę, jednocześnie doskonaląc swoje umiejętności komunikacyjne.

source: We also offer English lessons for Poles.
pl: Oferujemy również lekcje języka angielskiego dla Polaków.

source: Learn more
pl: Dowiedz się więcej

source: We are a modern online language school that combines a passion for teaching with experience and proven teaching methods.<br /><br />We teach English to Poles and Polish to foreigners – of all ages and at all levels.
pl: Jesteśmy nowoczesną szkołą językową online, która łączy pasję do nauczania z doświadczeniem i sprawdzonymi metodami dydaktycznymi.<br /><br />Uczymy języka angielskiego Polaków oraz języka polskiego obcokrajowców – w każdym wieku i na każdym poziomie zaawansowania.

source: Our goal is effective, engaging, and practical language learning — without stress or boredom.
pl: Naszym celem jest efektywna, angażująca i praktyczna nauka języków obcych — bez stresu i nudy.

source: Who are our courses for?
pl: Dla kogo są nasze kursy

source: For children from 7 years of age
pl: Dla dzieci od 7. roku życia

source: For primary and secondary school students
pl: Dla uczniów szkół podstawowych i średnich

source: For students
pl: Dla studentów

source: For adults learning for work or pleasure
pl: Dla dorosłych uczących się dla pracy lub przyjemności

source: For companies and organizations – language courses for employees
pl: Dla firm i organizacji – kursy językowe dla pracowników

source: Why Learn Polish With Us?
pl: Dlaczego warto uczyć się polskiego z nami?

source: 100%% online Polish courses – study anywhere in the world
pl: Kursy języka polskiego w 100% online – studiuj w dowolnym miejscu na świecie

source: Qualified and experienced Polish teachers
pl: Wykwalifikowani i doświadczeni nauczyciele języka polskiego

source: Tailored courses for beginners, intermediate, and advanced learners
pl: Kursy dostosowane do potrzeb początkujących, średnio zaawansowanych i zaawansowanych

source: Focus on real-life communication and cultural context
pl: Skupienie się na komunikacji w życiu realnym i kontekście kulturowym

source: Flexible schedules to fit your lifestyle
pl: Elastyczne harmonogramy dopasowane do Twojego stylu życia

source: Our teaching methods
pl: Nasze metody nauczania

source: Communication first
pl: Komunikacja przede wszystkim

source: We focus on speaking from the very first lesson because we believe it's the most effective way to speak the language fluently.
pl: Stawiamy na mówienie od pierwszych zajęć bo wierzymy, że to najskuteczniejsza droga do swobodnego posługiwania się językiem.

source: Language immersion method
pl: Metoda immersji językowej

source: Students immerse themselves in the language through interactive exercises, dialogues, and authentic materials.
pl: Uczniowie „zanurzają się” w języku przez interaktywne ćwiczenia, dialogi i materiały autentyczne.

source: Learn Flexible and Convenient
pl: Poznaj elastyczność i wygodę

source: No matter where you live, you can learn with us. Our online lessons take place on <span>Zoom</span>, <span>Skype</span>, or <span>Google Meet</span>, giving you direct contact with your teacher and interactive learning tools.
pl: Niezależnie od tego, gdzie mieszkasz, możesz uczyć się z nami. Nasze lekcje online odbywają się na <span>Zoomie</span>, <span>Skype</span> lub <span>Google Meet</span>, zapewniając bezpośredni kontakt z nauczycielem i interaktywne narzędzia do nauki.

source: Modern tools
pl: Nowoczesne narzędzia

source: We use video lesson platforms, interactive materials, and applications that support vocabulary and grammar learning.
pl: Korzystamy z platform do wideolekcji, interaktywnych materiałów, aplikacji wspierających naukę słownictwa i gramatyki.

source: Personalization
pl: Personalizacja

source: Every student has different needs, so we tailor the program to the student's level and goals.
pl: Każdy uczeń ma inne potrzeby, dlatego dopasowujemy program do poziomu i celów kursanta.

source: Regular feedback and progress tests
pl: Regularny feedback i testy postępów

source: Students always know what stage they are at and have constant contact with their teacher.
pl: Uczniowie zawsze wiedzą, na jakim są etapie i mają stały kontakt z lektorem.

source: Our teachers
pl: Nasi lektorzy

source: School Owner / Philologist / Educator / Teacher of Polish as a Foreign Language
pl: Właścicielka szkoły / Filolog / Pedagog / Lektor języka polskiegojako obcego

source: The owner of a language school has been working for years with young people and adults from around the world who want to better understand both the Polish language and culture. She is a native Polish speaker. She has extensive experience in preparing students for certification in Polish as a foreign language from levels A2 to C1, with students successfully passing the exams. She holds a bachelor's degree in English Philology, specializing in teaching, which provides her with pedagogical and methodological training in teaching foreign languages. She speaks English, Spanish, and Turkish.
pl: Właścicielka szkoły językowej od lat pracująca z młodzieżą i dorosłymi z całego świata, którzy chcą poznać lepiej zarówno język jak i kulturę Polski. Native speaker języka polskiego. Posiada duże doświadczenie w przygotowaniu do zdobycia certyfikatu znajomości języka polskiego jako obcego od poziomu A2 do C1 - uczniowie z powodzeniem otrzymują pozytywny wynik egzaminów. Absolwentka studiów licencjackich na kierunku filologia angielska specjalność nauczycielska, dzięki czemu posiada przygotowanie pedagogiczne oraz metodyczne w nauczaniu języków obcych. Zna angielski, hiszpański i turecki.

source: Philologist / Pedagogue / English teacher
pl: Filolog / Pedagog / Lektor języka angielskiego

source: A graduate of a BA in English Philology, specializing in teaching. An English teacher with 10 years of experience in tutoring, she specializes in individualized approaches to students and developing their language skills. She lived in Scotland for 12 years, where she completed an HNC in Early Education and Childcare, gaining knowledge in education and methodologies for working with children and young people. She conducts individual, group, and paired classes for children, adolescents, and adults. She also specializes in preparing young people for exams, providing a solid language foundation, a clear learning plan, and a friendly atmosphere that fosters consistency and self-confidence.
pl: Absolwentka studiów licencjackich na kierunku filologia angielska specjalność nauczycielska. Lektorka języka angielskiego z 10-letnim doświadczeniem w prowadzeniu korepetycji, specjalizująca się w indywidualnym podejściu do ucznia i rozwijaniu jego kompetencji językowych. Przez 12 lat mieszkała w szkocji, gdzie ukończyła HNC Early Education and Childcare, zdobywając wiedzę z zakresu edukacji i metodyki pracy z dziećmi oraz młodzieżą. Prowadzi zajęcia indywidualne, grupowe oraz w parach dla dzieci, dzieci młodzieży i dorosłych. Specjalizuje się także w przygotowaniu młodzieży do egzaminów, zapewniając solidne podstawy językowe, jasny plan nauki i przyjazną atmosferę sprzyjającą systematyczności i pewności siebie.

source: Course offer
pl: Oferta kursów

source: Polish courses for foreigners
pl: Kursy języka polskiego dla obcokrajowców

source: Polish from scratch
pl: Polski od podstaw

source: Learning basic language structures
pl: Nauka podstawowych struktur językowych

source: Everyday and situational vocabulary
pl: Słownictwo codzienne i sytuacyjne

source: Pronunciation and intonation exercises
pl: Ćwiczenia z wymowy i intonacji

source: Simple dialogues from everyday life (shopping, restaurants, travel)
pl: Proste dialogi z życia codziennego (zakupy, restauracja, podróże)

source: Sign up
pl: Dołącz

source: advanced <br />level
pl: poziom <br /> zaawansowany

source: Grammar, conversation, writing, and text comprehension
pl: Gramatyka, konwersacje, pisanie i rozumienie tekstu

source: Preparation for language certifications
pl: Przygotowanie do certyfikatów językowych

source: Individualized approach and language feedback
pl: Indywidualne podejście i feedback językowy

source: Polish<br />at work
pl: Polski<br />w pracy

source: Industry Vocabulary
pl: Słownictwo branżowe

source: Communication in a Professional Environment
pl: Komunikacja w środowisku zawodowym

source: Beginner group
pl: Grupa początkująca

source: Advanced group
pl: Grupa zaawansowana

source: Groups of max 5 people
pl: Grupy max 5 osób

source: Classes begin in mid-September and are held twice a week for 50 minutes each, lasting 14 weeks.
pl: Zajęcia zaczynają się od połowy września i odbywają się 2 razy w tygodniu po 50minut i trwają 14 tygodni.

source: month
pl: miesiąc

source: course
pl: kurs

source: English courses for Poles
pl: Kursy języka angielskiego dla Polaków

source: children<br />(classes 1-3)
pl: dzieci<br />(klasy 1-3)

source: Online classes in small groups or individually
pl: Zajęcia online w małych grupach lub indywidualnie

source: Learning through play, language games, and songs
pl: Nauka poprzez zabawę, gry językowe i piosenki

source: Homework help
pl: Pomoc w odrabianiu prac domowych

source: youth and<br />students
pl: dla młodzieży <br/> i uczniów szkół

source: School tutoring (grades 1–8 and high school)
pl: Korepetycje szkolne (klasy 1–8 oraz szkoły średnie)

source: Preparation for the eighth-grade exam and the Matura exam
pl: Przygotowanie do egzaminu ósmoklasisty i matury

source: Activities supporting conversation and vocabulary development
pl: Zajęcia wspierające konwersacje i rozwój słownictwa

source: adults
pl: Dla dorosłych

source: Courses from A1 to C1
pl: Kursy od poziomu A1 do C1

source: Business English
pl: Angielski w pracy (Business English)

source: Exam Preparation
pl: Przygotowanie do egzaminów

source: Conversations with a Teacher
pl: Konwersacje z lektorem

source: Classes begin in mid-September and are held twice a week for 60 minutes each, lasting 14 weeks.
pl: Zajęcia zaczynają się od połowy września i odbywają się 2 razy w tygodniu po 60minut i trwają 14 tygodni.

source: Online Foreign Language School
pl: Szkoła Języków Obcych Online

source: Polish and English
pl: Polski i Angielski

source: School owner / Philologist / Pedagogue / Polish language teacher
pl: Właścicielka szkoły / Filolog / Pedagog / Lektor języka polskiego

source: Contact with us
pl: Skontaktuj się z nami

source: Full name
pl: Imię i nazwisko

source: Phone number
pl: Numer telefonu

source: Your message
pl: Twoja wiadomość

source: Send message
pl: Wyślij wiadomość
